# NotBentSymbol Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BendFailures..::..NotBentSymbol Property
BuiltInFailures..::..BendFailures Class See Also
---
While making curved beam type "[Type Name]" Symbol elements were not created
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotBentSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotBentSymbol As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotBentSymbol {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..BendFailures Class
Autodesk.Revit.DB Namespace